////////////////////////////////////////////////////////////////////////////
//
// This file is part of sc4-more-building-styles, a DLL Plugin for
// SimCity 4 that adds support for more building styles.
//
// Copyright (c) 2024 Nicholas Hayes
//
// This file is licensed under terms of the MIT License.
// See LICENSE.txt for more information.
//
////////////////////////////////////////////////////////////////////////////

#include "TractDeveloperHooks.h"
#include "BuildingUtil.h"
#include "cGZPersistResourceKey.h"
#include "cIGZPersistResourceManager.h"
#include "cIGZString.h"
#include "cIGZVariant.h"
#include "cISCProperty.h"
#include "cISCPropertyHolder.h"
#include "cISC4BuildingDevelopmentSimulator.h"
#include "cISC4BuildingOccupant.h"
#include "cISC4GrowthDeveloper.h"
#include "cISC4Lot.h"
#include "cISC4LotConfiguration.h"
#include "cRZAutoRefCount.h"
#include "GlobalPointers.h"
#include "GZServPtrs.h"
#include "Logger.h"
#include "Patcher.h"
#include "PropertyIDs.h"
#include "SC4Rect.h"
#include "SC4String.h"
#include "SC4Vector.h"
#include "SC4VersionDetection.h"
#include "WallToWallOccupantGroups.h"
#include <span>

#include "wil/result.h"

struct cSC4TractDeveloper
{
	struct CandidateLot
	{
		enum class DevelopmentType : uint32_t
		{
			TakeOverAbandoned = 1,
			LotSameSize = 2,
			LotAggregation = 3,
			LotSubdivision = 4,
		};

		DevelopmentType developmentType;			// 0x0
		cISC4Lot* pExistingLot;						// 0x4
		uint32_t lotLocationX;						// 0x8
		uint32_t lotLocationZ;						// 0xc
		uint32_t facing;							// 0x10
		uint8_t lotSizeX;							// 0x14
		uint8_t lotSizeZ;							// 0x15
		uint32_t lotSet[3];							// 0x18 - set<cISC4Lot*>
		int32_t totalNonVacantCapacity;				// 0x24
		int32_t totalVacantCapacity;				// 0x28
		uint32_t growthStage;						// 0x2c
		cISC4BuildingOccupant::WealthType wealth;	// 0x30
		float score;								// 0x34
		SC4Rect<int32_t> lotBounds;					// 0x38
		uint8_t unknown1[0x28];
		// The following 4 vectors appear to be network related.
		// Tracking Road/street connections for each side of the lot?
		SC4Vector<uint32_t> field_0x70;				// 0x70
		SC4Vector<uint32_t> field_0x7c;				// 0x7c
		SC4Vector<uint32_t> field_0x88;				// 0x88
		SC4Vector<uint32_t> field_0x94;				// 0x94
		uint8_t field_0xa0;							// 0xa0
	};

	static_assert(sizeof(CandidateLot) == 0xa4);
	static_assert(offsetof(CandidateLot, pExistingLot) == 0x4);
	static_assert(offsetof(CandidateLot, lotSet) == 0x18);
	static_assert(offsetof(CandidateLot, lotBounds) == 0x38);
	static_assert(offsetof(CandidateLot, field_0x70) == 0x70);
	static_assert(offsetof(CandidateLot, field_0xa0) == 0xa0);

	void* vtable;												// 0x0
	void* messageTarget2;										// 0x4
	void* gzSerialzable;										// 0x8
	int initialized;											// 0xc
	int refCount;												// 0x10
	void* pMS2;													// 0x14
	void* pCity;												// 0x18
	cISC4BuildingDevelopmentSimulator* pBuildingDevelopmentSim; // 0x1c
	void* pLandValueSim;										// 0x20
	void* pLotConfigurationManager;								// 0x24
	void* pLotDeveloper;										// 0x28
	void* pLotManager;											// 0x2c
	void* pPlumbingSim;											// 0x30
	void* pPowerSim;											// 0x34
	void* pTrafficSim;											// 0x38
	void* pZoneManager;											// 0x3c
	// begin tunable values
	float overbuild;											// 0x40
	float reoccupyThresholds[2];								// 0x44
	float redevelopSizeThreshold;								// 0x4c
	float demolitionCosts[2];									// 0x50
	float newLotCosts[2];										// 0x58
	float occupancyVariation;									// 0x60
	float minVacancyRange[2];									// 0x64
	uint8_t kickOutLowerWealth;									// 0x6c
	uint8_t kickOutLowerWealthPadding[3];
	SC4Vector<uint32_t> availableStyles;						// 0x70
	int yearsBetweenStyles;										// 0x7c
	// end tunable values
	cISC4GrowthDeveloper* pCurrentDeveloper;					// 0x80
	uint8_t unknown1[0x94];										// 0x84 - 0x117
	SC4Vector<uint32_t> activeStyles;							// 0x118
	uint32_t currentStyleIndex;									// 0x124
	uint32_t yearsPassed;										// 0x128
	uint8_t changeStylesEveryNYears;							// 0x12c
};

static_assert(offsetof(cSC4TractDeveloper, initialized) == 0xc);
static_assert(offsetof(cSC4TractDeveloper, pZoneManager) == 0x3c);
static_assert(offsetof(cSC4TractDeveloper, kickOutLowerWealth) == 0x6c);
static_assert(offsetof(cSC4TractDeveloper, yearsBetweenStyles) == 0x7c);
static_assert(offsetof(cSC4TractDeveloper, activeStyles) == 0x118);
static_assert(offsetof(cSC4TractDeveloper, currentStyleIndex) == 0x124);
static_assert(offsetof(cSC4TractDeveloper, changeStylesEveryNYears) == 0x12c);

struct cSC4LotConfiguration
{
	void* vtable;
	uint32_t refCount;
	uint32_t id;
	SC4String name;
	uint8_t unknown1[0x60];
	SC4Vector<uint32_t> buildingOccupantGroups;
};

static_assert(offsetof(cSC4LotConfiguration, buildingOccupantGroups) == 0x80);

static uintptr_t IsLotConfigurationSuitable_CompatableStyleFound_Continue;
static uintptr_t IsLotConfigurationSuitable_NoCompatableStyle_Continue;

